#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.ecs.data.aws_iam_policy_document.main: Reading...
module.network-services.aws_vpc.main: Refreshing state... [id=vpc-0ca9af9621f901f0e]
module.ecr.aws_ecr_repository.main: Refreshing state... [id=ecs-website-images]
module.ecs.data.aws_iam_policy_document.main: Read complete after 0s [id=1077804475]
module.network-services.aws_route_table.main: Refreshing state... [id=rtb-0e04a3b6129e5cee8]
module.network-services.aws_internet_gateway.main: Refreshing state... [id=igw-0cdd9183ba801e00b]
module.network-services.aws_subnet.main["subnet-1"]: Refreshing state... [id=subnet-05af11b9196479444]
module.network-services.aws_subnet.main["subnet-2"]: Refreshing state... [id=subnet-0e8847b8396228338]
module.network-services.aws_security_group.main["ecs-lb-sg"]: Refreshing state... [id=sg-0bf19f0e9313d4059]
module.network-services.aws_alb_target_group.main: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:378842471989:targetgroup/ecs-website-tg/e6c58a4b10ba3aa6]
module.network-services.aws_main_route_table_association.main: Refreshing state... [id=rtbassoc-00cbf2a5a16917e2e]
module.network-services.aws_route.main: Refreshing state... [id=r-rtb-0e04a3b6129e5cee81080289494]
module.network-services.aws_route_table_association.main["subnet-1"]: Refreshing state... [id=rtbassoc-0667279ae0deb7015]
module.network-services.aws_alb.main: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:378842471989:loadbalancer/app/ecs-website-alb/f3d9d93264472e41]
module.network-services.aws_route_table_association.main["subnet-2"]: Refreshing state... [id=rtbassoc-098522999eb23276a]
module.network-services.aws_alb_listener.https: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:378842471989:listener/app/ecs-website-alb/f3d9d93264472e41/88db8e96bf861659]
module.network-services.aws_lb_listener.http: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:378842471989:listener/app/ecs-website-alb/f3d9d93264472e41/d1affba9ed9cad39]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.ecs.aws_ecs_cluster.main will be created
  + resource "aws_ecs_cluster" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "ecs-fargate-cluster"
      + tags     = {
          + "Name" = "ecs-fargate-cluster"
        }
      + tags_all = {
          + "Environment" = "Test"
          + "Managed-by"  = "Terraform"
          + "Name"        = "ecs-fargate-cluster"
        }
    }

  # module.ecs.aws_ecs_service.main will be created
  + resource "aws_ecs_service" "main" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "ecs-fargate-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "Name" = "ecs-fargate-service"
        }
      + tags_all                           = {
          + "Environment" = "Test"
          + "Managed-by"  = "Terraform"
          + "Name"        = "ecs-fargate-service"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "bernatei-website"
          + container_port   = 80
          + target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:378842471989:targetgroup/ecs-website-tg/e6c58a4b10ba3aa6"
        }

      + network_configuration {
          + assign_public_ip = true
          + security_groups  = [
              + "sg-0bf19f0e9313d4059",
            ]
          + subnets          = [
              + "subnet-05af11b9196479444",
              + "subnet-0e8847b8396228338",
            ]
        }
    }

  # module.ecs.aws_ecs_task_definition.main will be created
  + resource "aws_ecs_task_definition" "main" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + cpu          = 512
                  + essential    = true
                  + image        = "378842471989.dkr.ecr.us-east-1.amazonaws.com/ecs-website-images:v1"
                  + memory       = 1024
                  + name         = "bernatei-website"
                  + portMappings = [
                      + {
                          + containerPort = 80
                          + hostPort      = 80
                        },
                    ]
                },
            ]
        )
      + cpu                      = "512"
      + execution_role_arn       = (known after apply)
      + family                   = "ecs-fargate-task"
      + id                       = (known after apply)
      + memory                   = "1024"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "Name" = "ecs-fargate-task"
        }
      + tags_all                 = {
          + "Environment" = "Test"
          + "Managed-by"  = "Terraform"
          + "Name"        = "ecs-fargate-task"
        }

      + runtime_platform {
          + cpu_architecture        = "X86_64"
          + operating_system_family = "LINUX"
        }
    }

  # module.ecs.aws_iam_role.main will be created
  + resource "aws_iam_role" "main" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ecs-fargate-task-executionrole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "Test"
          + "Managed-by"  = "Terraform"
          + "Name"        = "Example"
        }
      + unique_id             = (known after apply)
    }

  # module.ecs.aws_iam_role_policy_attachment.name will be created
  + resource "aws_iam_role_policy_attachment" "name" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "ecs-fargate-task-executionrole"
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @bertei, Action: `pull_request`*